Documents/Requests/Soap_ValidateAddress- API Mode_22_02_2022_10_59_03_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/address/VFDEValidateAddress" xmlns:vfd1="http://amdocs/vfde/address/VFDEValidateAddressInput">
  <soapenv:Header />
  <soapenv:Body>
    <vfd:ValidateAddressRequest>
      <vfd1:ROOT>
        <Event>
          <Type>ValidateAddress</Type>
          <ID>Saurav12345</ID>
        </Event>
        <DATA>
          <Portal>OFT</Portal>
          <ZipCode>63936</ZipCode>
          <City>Schneeberg</City>
          <Street>Roscheklinge</Street>
          <HouseNumber>12</HouseNumber>
        </DATA>
      </vfd1:ROOT>
    </vfd:ValidateAddressRequest>
  </soapenv:Body>
</soapenv:Envelope>